src/cf/Documents/уатОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатОприходованиеТоваров</Name>
			<Comment>Оприходование материалов (уат)</Comment>
			<BasedOn>
				<xr:Item>Document.уатИнвентаризацияТоваров</xr:Item>
				<xr:Item>Document.уатСписаниеАгрегатов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатТоварыВЯчейках</xr:Item>
				<xr:Item>InformationRegister.уатДатыДвиженияТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатСпецодеждаИИнструментыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатСписаниеАгрегатов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатИнвентаризацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>(Общ) Основание (статья) оприходования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатСпецодеждаИИнструментыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатСпецодеждаИИнструментыСотрудников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Первоначальная стоимость в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИзноса</Name>
					<Comment>Сумма износа в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/уатОприходованиеТоваров/Forms/ПодборВыданнойСпецодежды/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Сотрудник") Тогда
		Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	Если Параметры.Свойство("Период") Тогда
		Период = Параметры.Период;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПустаяСтрока(ВариантОтбора) Тогда
		ВариантОтбора = "Все";
	КонецЕсли;
	
	ЗагрузитьСпецодеждуСотрудников();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого ТекСтрока Из Спецодежда Цикл
		ТекСтрока.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого ТекСтрока Из Спецодежда Цикл
		ТекСтрока.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	мсвСтроки = Новый Массив;
	Для Каждого ТекСтрока Из Спецодежда Цикл
		Если НЕ ТекСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСтруктура = Новый Структура;
		СтрокаСтруктура.Вставить("Номенклатура", ТекСтрока.Номенклатура);
		СтрокаСтруктура.Вставить("ЕдиницаИзмерения", уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(
			ТекСтрока.Номенклатура, "ЕдиницаХраненияОстатков"));
		СтрокаСтруктура.Вставить("Количество", ТекСтрока.Количество);
		СтрокаСтруктура.Вставить("Сумма", ТекСтрока.Стоимость);
		СтрокаСтруктура.Вставить("Цена", ?(ТекСтрока.Количество = 0, 0, ТекСтрока.Стоимость / ТекСтрока.Количество));
		мсвСтроки.Добавить(СтрокаСтруктура);
	КонецЦикла;
		
	Закрыть(мсвСтроки);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОтбораПриИзменении(Элемент)
	
	ЗагрузитьСпецодеждуСотрудников();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСпецодежда

&НаКлиенте
Процедура СпецодеждаПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Спецодежда.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ТекНоменклатура = Неопределено;
	Иначе
		ТекНоменклатура = ТекСтрока.Номенклатура;
	КонецЕсли;
	
	СтруктураОтбор = Новый Структура("Номенклатура", ТекНоменклатура);
	Элементы.СпецодеждаПартии.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбор);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьСпецодеждуСотрудников()
	
	ЗапросСпецодеждаСотрудников = Новый Запрос(
	"ВЫБРАТЬ
	|	уатСпецодежда.Номенклатура КАК Номенклатура,
	|	уатСпецодежда.ДатаВыдачи КАК ДатаВыдачи,
	|	уатСпецодежда.КоличествоОстаток КАК Количество,
	|	уатСпецодежда.СтоимостьОстаток - уатСпецодежда.СуммаИзносаОстаток КАК Стоимость,
	|	ДОБАВИТЬКДАТЕ(уатСпецодежда.ДатаВыдачи, МЕСЯЦ, уатСпецодежда.Номенклатура.МодельСпецодеждыИлиИнструмента.СрокИспользования) КАК СрокИспользования
	|ИЗ
	|	РегистрНакопления.уатСпецодеждаИИнструментыСотрудников.Остатки(&Период, Сотрудник = &Сотрудник) КАК уатСпецодежда
	|ГДЕ
	|	(НЕ &ОтборНулеваяСтоимость ИЛИ уатСпецодежда.СтоимостьОстаток - уатСпецодежда.СуммаИзносаОстаток = 0)
	|	И (НЕ &ОтборСрокИспользования ИЛИ ДОБАВИТЬКДАТЕ(уатСпецодежда.ДатаВыдачи, МЕСЯЦ, уатСпецодежда.Номенклатура.МодельСпецодеждыИлиИнструмента.СрокИспользования) <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ))");
	ЗапросСпецодеждаСотрудников.УстановитьПараметр("Период", Период);
	ЗапросСпецодеждаСотрудников.УстановитьПараметр("Сотрудник", Сотрудник);
	ЗапросСпецодеждаСотрудников.УстановитьПараметр("ОтборНулеваяСтоимость", ВариантОтбора = "С нулевой остаточной стоимость");
	ЗапросСпецодеждаСотрудников.УстановитьПараметр("ОтборСрокИспользования", ВариантОтбора = "С истекшим сроком использования");
		
	тблСпецодежда = ЗапросСпецодеждаСотрудников.Выполнить().Выгрузить();
	
	СпецодеждаПартии.Загрузить(тблСпецодежда);
	СпецодеждаПартии.Сортировать("Номенклатура, ДатаВыдачи");
	
	тблСпецодежда.Свернуть("Номенклатура", "Количество, Стоимость");
	Спецодежда.Загрузить(тблСпецодежда);
	
КонецПроцедуры

#КонецОбласти
